[Killed] BlockStatement
app/services/pizaService.ts:9:50
   export class PizaService {
     private repo: PizaRepo;
 
-    constructor(repo: PizaRepo = pizaRepository) {
-      this.repo = repo;
-    }
+    constructor(repo: PizaRepo = pizaRepository) {}
 
     async getAllPizas() {
killedBy: Piza API (integration using sqlite in-memory) POST /pizas створює та GET /pizas/:id повертає
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
app/services/pizaService.ts:13:25
       this.repo = repo;
     }
 
-    async getAllPizas() {
-      return this.repo.findAll();
-    }
+    async getAllPizas() {}
 
     async getPizaById(id: string) {
killedBy: Piza API (integration using sqlite in-memory) GET /pizas повертає масив
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/services/pizaService.ts:17:35
       return this.repo.findAll();
     }
 
-    async getPizaById(id: string) {
-      if (!id) return null;
-      return this.repo.findById(id);
-    }
+    async getPizaById(id: string) {}
 
     async createPiza(data: PizaData) {
killedBy: Piza API (integration using sqlite in-memory) POST /pizas створює та GET /pizas/:id повертає
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
app/services/pizaService.ts:18:11
     }
 
     async getPizaById(id: string) {
-      if (!id) return null;
+      if (id) return null;
       return this.repo.findById(id);
     }
killedBy: Piza API (integration using sqlite in-memory) POST /pizas створює та GET /pizas/:id повертає
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
app/services/pizaService.ts:18:11
     }
 
     async getPizaById(id: string) {
-      if (!id) return null;
+      if (false) return null;
       return this.repo.findById(id);
     }
killedBy: PizaService getPizaById повертає null при порожньому id
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
app/services/pizaService.ts:22:38
       return this.repo.findById(id);
     }
 
-    async createPiza(data: PizaData) {
-      if (!data || typeof data.name !== 'string' || typeof data.ingridients !== 'string' || typeof data.price !== 'number') {
-        throw new Error('Invalid payload');
-      }
-      const insertId = await this.repo.insert({ name: data.name, ingridients: data.ingridients, price: data.price });
-      return this.repo.findById(String(insertId));
-    }
+    async createPiza(data: PizaData) {}
 
     async updatePiza(id: string, patch: Partial<PizaData>) {
killedBy: Piza API (integration using sqlite in-memory) POST /pizas створює та GET /pizas/:id повертає
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
app/services/pizaService.ts:23:93
     }
 
     async createPiza(data: PizaData) {
-      if (!data || typeof data.name !== 'string' || typeof data.ingridients !== 'string' || typeof data.price !== 'number') {
+      if (!data || typeof data.name !== 'string' || typeof data.ingridients !== 'string' || false) {
         throw new Error('Invalid payload');
       }
killedBy: PizaService createPiza edge cases to kill survived mutants кидає помилку якщо price не число
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
app/services/pizaService.ts:23:11
     }
 
     async createPiza(data: PizaData) {
-      if (!data || typeof data.name !== 'string' || typeof data.ingridients !== 'string' || typeof data.price !== 'number') {
+      if (true) {
         throw new Error('Invalid payload');
       }
killedBy: Piza API (integration using sqlite in-memory) POST /pizas створює та GET /pizas/:id повертає
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
app/services/pizaService.ts:30:60
       return this.repo.findById(String(insertId));
     }
 
-    async updatePiza(id: string, patch: Partial<PizaData>) {
-      if (!id) return null;
-      const existing = await this.repo.findById(id);
-      if (!existing) return null;
-      await this.repo.update(id, patch);
-      return this.repo.findById(id);
-    }
+    async updatePiza(id: string, patch: Partial<PizaData>) {}
 
     async deletePiza(id: string) {
killedBy: Piza API (integration using sqlite in-memory) PUT /pizas/:id оновлює запис
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
app/services/pizaService.ts:31:11
     }
 
     async updatePiza(id: string, patch: Partial<PizaData>) {
-      if (!id) return null;
+      if (id) return null;
       const existing = await this.repo.findById(id);
       if (!existing) return null;
killedBy: Piza API (integration using sqlite in-memory) PUT /pizas/:id оновлює запис
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
app/services/pizaService.ts:31:11
     }
 
     async updatePiza(id: string, patch: Partial<PizaData>) {
-      if (!id) return null;
+      if (false) return null;
       const existing = await this.repo.findById(id);
       if (!existing) return null;
killedBy: PizaService updatePiza повертає null якщо id пустий
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ""

[Killed] ConditionalExpression
app/services/pizaService.ts:33:11
     async updatePiza(id: string, patch: Partial<PizaData>) {
       if (!id) return null;
       const existing = await this.repo.findById(id);
-      if (!existing) return null;
+      if (false) return null;
       await this.repo.update(id, patch);
       return this.repo.findById(id);
killedBy: Piza E2E PUT /pizas/:id оновлює піцу
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
app/services/pizaService.ts:33:11
     async updatePiza(id: string, patch: Partial<PizaData>) {
       if (!id) return null;
       const existing = await this.repo.findById(id);
-      if (!existing) return null;
+      if (existing) return null;
       await this.repo.update(id, patch);
       return this.repo.findById(id);
killedBy: PizaService updatePiza оновлює та повертає оновлену піцу
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
app/services/pizaService.ts:38:34
       return this.repo.findById(id);
     }
 
-    async deletePiza(id: string) {
-      if (!id) return false;
-      return this.repo.remove(id);
-    }
+    async deletePiza(id: string) {}
   }
 
killedBy: PizaService deletePiza повертає false при порожньому id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
app/services/pizaService.ts:39:11
     }
 
     async deletePiza(id: string) {
-      if (!id) return false;
+      if (false) return false;
       return this.repo.remove(id);
     }
killedBy: PizaService deletePiza повертає false при порожньому id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
app/services/pizaService.ts:39:11
     }
 
     async deletePiza(id: string) {
-      if (!id) return false;
+      if (id) return false;
       return this.repo.remove(id);
     }
killedBy: PizaService deletePiza повертає false при порожньому id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
